Revit 2016 API
AreaLoad.NumCurves Property
Returns the number of curves within a geometric loop that defines the area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public int this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")> _
Public ReadOnly Property NumCurves ( _
	index As Integer _
) As Integer
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public:
property int NumCurves[int index] {
	int get (int index);
}
Parameters
index
Type: System.Int32
The index of the geometric loop.
Remarks
The index should be between 0 and less than NumLoops.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace